// 1) შექმენით ფაილი სახელად index.js, ფაილის შემქენის შემდეგ დააინსტალირეთ тpm ხელსაწყოს გამოყენებიუთ სამართავი ფაილი, სამართავი ფაილის დაინსტალირების შემდეგ გადმოწერეთ package სახელად chalk, გამოიყენეთ და გატესტეთ მინიმუმ 10 სხვადასხვა შემთხვევა დოკუმენტაციის დახმარებით, თქვენ მოგიწევთ import export გამოყენება თანამ,ედროვე გზით ამიტომ package ფაილის დახმარებით უნდა შეცვალოთ ტიპი (კომენტარებით ახსენით რა არის package.json, package-lock.json, node_modules, commonJS, module) აგრეთვე ახსენით კომენტარებით რა არის npmხელსაწყო და რა პრობლემებს ჭრის ის

import chalk from 'chalk';

console.log(chalk.green('Hello World!'));
