// 1) chatgpt დააწერინეთ 10 ობიექტი სადაც გექნებათ რიცხვების მასივი, შემდეგ დააიმპორტეთ თქვენს ლოკალურ ბაზაში 
//2) გამოიყენეთ ყველა შესაძლებლობა რაც ვისწავლეთ მასივებისთის საძიებელი ბრძანებების შექმნისთვის (მაგ: მასივის ზუსტი შედარება, ერთი ელემენტის შემოწმება, რამდენიმე ელემენტის შემოწმება გვაქვს თუ არა მასივში და comparisionოპერატორები თავისი $elemMatch ბრძანებებით) აუცილებლად თითოეული ბრძანება ჩაიწერეთ და ახსენით კომენტარებით რაში და როგორ გამოიყენეთ ის.

// db.objects.find({numbers : {$elemMatch:{$gt: 5, $lt: 15}}}) ამით ვეძებ იმ ობიექტებს რომლების number მასივში ელემეტის მნშვნელობა არის მეტი 5 ზე და ნაკლები 15 ზე

// db.objects.find({numbers: 10}) ამით ვეძებ ისეთ ობიექტს სადაც numbers მასივშ არის ელემენტი 10 იანი

//db.objects.find({numbers: {$all: [2,4]}}) ამით კი ვეძებთ ისეთ ობიექტს სადაც numbers მასივში არის 2ც და 4 იც ერთად