// 2) შექმენით კონსტრუქტორი სახელად Car რომელშიც 3 კუთვნილების ინიციალიზებას გააკეთებთ, brand, model და გამოშვების წელი აგრეთვე დაამატეთ მეთოდი introduce რომელიც უბრალოდ დაბეჭდავს მანქანის ბრენდს, მოდელდა გამოშვების თარიღს,ს  კონსტრუქტორს ლოგიკურია უნდა ჰქონდეს 3 პოარამეტრი ობიექტის შესაქმნელად, გამოიძახეთ კონსტრუქტორი დსა შექმენიოთ 4 ობიექტი (აუცილებლად ახსენით კომენტარებით რა არის კონსტრუქტორი რა პლიუსები და მინუსები აქვს  მას)

function Car(brand,model,year){
    this.brand = brand
  this.model = model  
  this.year = year

  this.introduce = function (){
    console.log(`მანქანა ${this.brand},მოდელი ${this.model},გამოშვების წელი ${year}`)
  }
}

const car1 = new Car('Mercedes','Cls 63','2014')

const car2 = new Car(
    'Toyota','Avalon','2011'
)

const car3 = new Car(
    'Lexus','LX 570','2007'
)

const car4 = new Car(
    'Wolkswagen','jetta','2022'
)

car1.introduce()
car2.introduce()
car3.introduce()
car4.introduce()

// კონსტრუქტორის პლიუსებია: კოდს ამარტივებს შეგვიძლია გამოვიყენოთ ხელახლა რამდენჯერაც გვინდა 

// კონსტრუქტორის მინუსებია: თითოეულ ობიეკტს უნდა ქონდეს და ეს იყენებს უფრო მეტ მეხსიერებას და დროს  შეიძლება მაგის გამოყენებისას აირიოს this