// 1) თქვენს პროექტში socialbook, დაამატეთ ახალი controller, router, model -- post - ისთვის, controller - ების ფაილში პოსტების ატვირთვის წაშლის წამოღებისა და განახლების გარდა დაამატეთ, მომხმარებლის (თავისი) პოსტების წამოღების ფუნქციაც

// 2) ვისაც არ გაქვთ დასრულებული Level 157 - ზე მოცემული დავალებები ყველამ დაასრულეთ, თქვენს პროექტში გამოიყენეთ .env - ფაილიც და ახსენით თუ რისთვის გამოიყენება ის

// .env ფაილი გამოყენება იმისთვის რომ გავხადოთ დაცვული და უსაფრთხო ინფორმაცია ჩვენს საიტზე მაგალითად მონაცემთაბაზის სახელი ან რომელ პორტზეა გაშვებული სერვერი და ა.შ 
// ასევე არუნდა აიტვირთოს ეგ ჩენი env ფაილი გითაბზეც და ის უნდ აიყოს შენახული .gitignore ფაილში რათა არაიტვირთოს