//1) fetch - ით გააგზავნეთ მოთხოვნა  ამ მისამართზე, გამოიყენეთ დღევანდელ გაკვეთილზე ნასწავლი async/await და try/catch, გამოიტანეთ ელემენტები საიტზე თავისი ინფორმაციით (css - ის დახმარებით გასტილეთ), დაასრულეთ Level 76 - ის დავალება (დაამატეთ add To Cart და delete From Cart ფუნქციებიც ამ პროდუქტებს)

//2) კომენტარების სახით ახსენით თქვენს მიერ დაწერილი კოდი დეტალურად, ასევე კარგად გაიაზრეთ



// აქ შევქმენი arrow ფუნქცია სახელად  as მასში შევინახე async rდგან ფუნქცია გახდეს ასინქნორული და მასში გამოვიყენო await
const as = async () =>{
    //შემდეგ გამოვიყენე try მეთოდი 
    try{
        // აქ შემქმენი ცვლადი სახელად aw  და მასში შევინახე fetch რომელიც აგზავნის მოთხოვნას სერვერთან და გამოვიყენე await რადგა ველოდებოდი ობიექტის პასუხს
        let aw = await fetch('https://fakestoreapi.com/products')
        // აქ შევქმენი ცვლადი სახელად idk და მასში შევინახე aw.json და გადავიყვანე aw ცვლადი json ში რასაც გადაყავს პასუხი json მონაცემებად 
        let idk = await aw.json()
        // აქ კი კონსოლშ დავბეჭდე ეგ json ის მონაცემები რო მენახა რამონაცემები იყო
        console.log(idk)

        // აქ მოვიპოვე წვდომა ჩემს html ელემენტზე  id მეშვეობით რათა მქონდეს მასზე სრული წვდომა
        let ul = document.getElementById("ul")

        // აქ კი ჩემს ზემოთ შექმნილ ცვლადზე გამოვიყენე foreach() მეთოდი და გადავუარე მთელ სიას და სიის ყველა ელემენტი ჩავსვი ჯერ ul სიის თეგებშ შემდეგ p-პარაგრაფებში
        idk.forEach(rend =>{
            // აქ innerHtml თი გამოვიტანე ეკრანზე მონაცემები
            ul.innerHTML += `<ul>
            <p>Title: ${rend.title}</p>
            <p>Description: ${rend.description}</p>
            <img src = ${rend.image} />
            <p>Price: ${rend.price} $</p>
        </ul>
            `
        })


    // აქ გამოვიყენე catch() რათა ჩემით ვმართო error ები
    }catch(eror){
        console.error("this is error",eror)
    }

    
}

// და აქ უკვე საბოლლოდ გამოვიძახე ფუნქცია
as()
