import { useState } from 'react'
import User from './User'



function App() {
 

  return (
    <main>
      <User name = "Niko" age = {17} email = "kvelaa"/>
    </main>
  )
}

export default App




// 2) მოიძიეთ ინფორმაცია იმაზე თუ როგორ ხდება გასტილვა React - ში, გააკეთეთ რამოდენიმე მაგალითი

// 3) დეტალურად ახსენით კომენტარების სახით თუ რა არის props - რაში გამოვიყენებთ ჩვენ მას

// 4) შექმენით კომპონენტი სახელად User რომელიც props - ად იღებს name, age, email და გამოაქვს ისინი ეკრანზე, გამოიძახეთ User კომპონენტი მთავარ App.jsx - ის ფაილში და გადაეცით props - ად შესაბამისი მნიშვნელობები

// 5) codecademy - ში default props - ის სექციის გავლის შემდეგ გააკეთეთ მასზე მაგალითები და ახსენით კომენტარების სახით

// // შეგიძლიათ გამოიყენოთ დესტრუქცია და დაშალოთ props - ობიექტი რადგან უფრო გაგიადვილდეთ მუშაობა