// 2) შექმენით მასივი შეინახეთ მასში ფილმები, შექმენით ერთი ცვლადი removedElement და მასში შეინახეთ იმ index ზე მდგომი მნიშვნელობა რომელიც გინდათ რომ წაშალოთ ამისთვის გამოიყენეთ pop მეთოდი მიღებული (განახლებული) მასივი კი გამოიტანეთ console ში, კომენტარების სახით ახსენით აბრუნებს თუ არა pop მეთოდი წაშლილ მნიშვნელობას

let films = ['Who am i','Zoro','Transporter','Paradox']

    let removedElement = films.pop()
        console.log("წაშლილი ელემენტი:",removedElement)


        console.log("ახალი სია:", films)  
        
// კი pop() აბრუნებს წაშლილ მნიშვნელობას