// 1) კარგად მოიძიეთ ინფორმაცია HTTP - თან დაკავშირებით, კარგად გაიაზრეთ მისი მუშაობა, თქვენი სიტყვებით დეტალურად ახსენით თუ რა არის ის და რაში გამოიყენება, მოიყვანეთ მაგალითებიც, ისაუბრეთ მის ვერსიებზეც

//HTTP არის Hyper Text Transfer Protocol ანუ ეს არის უსაფრთხოების პროტოკოლი რისი მეშვეობითაც ხდება ინფორმაციის გაცვლა ბრაუზერსა და სერვერს
//  შორის მაგალითდ როცა ვსერჩავთ youtube.com ამდროს ხდება მოთხოვნის გაგაზავნა და საპასუხოდ ბრუნდება უკვე იუთუბის html css js ჩვენს ეკრანზე

// HTTP არის სტატუსების მეთოდების ჰედერების და წესების ერთობლიობა, 
// რომელიც აღწერს როგორ უნდა ელაპარაკონ ერთმანეთს ბრაუზერი და სერვერი

//HTTP მუშაობს მეთოდებით როგორებიცაა 
// Header-Get,Post
//HEADERS - User-Agend-Coockies
//Path- /home /Login
//Body -  მონაცემები Post ზე


// GET	ინფორმაციის მიღება	გვერდის ჩატვირთვა
// POST	ინფორმაციის გაგზავნა	რეგისტრაცია ლოგინი ფორმები
// PUT	მონაცემის განახლება	პროფილის შეცვლა
// DELETE	მონაცემის წაშლა	პოსტის წაშლა
// PATCH	ნაწილობრივი განახლება	ერთი ველის შეცვლა



// HTTP Status Codes 
// 2xx — წარმატებული

// 200 OK – ყველაფერი რიგზეა

// 201 Created – რამე შეიქმნა




// 3xx — გადამისამართება

// 301 Moved Permanently

// 302 Found





// 4xx — მომხმარებლის შეცდომა

// 400 Bad Request

// 401 Unauthorized

// 403 Forbidden

// 404 Not Found

// 5xx — სერვერის შეცდომა

// 500 Internal Server Error

// 503 Service Unavailable



// HTTP-ის ვერსიები 
// HTTP/1.0 1996

// ყოველ მოთხოვნაზე ახალი კავშირი იქმნებოდა

// ძალიან ნელა მუშაობდა

// არ იყო ჰედერები სრულად





// HTTP/1.1 1997 – დღემდე არის  ყველაზე პოპულარული

// Persistent connections ერთი კავშირი მრავალ მოთხოვნას ემსახურება

// Keep-Alive

// Chunked transfer

// უფრო სწრაფია

// HTTP/2 2015

// Multiplexing  ერთ კავშირზე ბევრი მოთხოვნა ერთდროულად

// Binary protocol  ტექსტის მაგივრად უფრო სწრაფი ბინარული ფორმატი

// Header compression  სწრაფი

// გვერდები 2-3 ჯერ სწრაფად იტვირთება




// HTTP/3 2022 უახლესი

// მუშაობს QUIC პროტოკოლზე UDP TCP-ს ნაცვლად

// დაბალი latency       TikTok, YouTube იყენებს უკვე

// მობილურზე განსაკუთრებით სწრაფია

// ნაკლები დაგვიანება და უფრო სტაბილური კავშირი




// ანუ  HTTP არის პროტოკოლი რომელიც განსაზღვრავს როგორ უნდა მოხდეს მოთხოვნის გაგზავნა და პასუხის მიღება ბრაუზერსა და სერვერს შორის
//  მისი ვერსიები განვითარდა სიჩქარის და უსაფრთხოების გასაუმჯობესებლად HTTP/1.1 კი ყველაზე გავრცელებული ვერსიაა ხოლო 
// HTTP/2 უფრო სწრაფია და  HTTP/3 უკვე მომავლის სტანდარტია