// 2) გამოიყენეთ for in ციკლი როგორც მასივზე ისე ობიექტზე, ახსენით კომენტარებით მისი მუშაობა და დანიშნულება შემდეგ მოიძიეთ ინფორმაცია for of ციკლის შესახებ და გააკეთეთ ერთი მაგალითი მისი გამოყენებისა (ცადეთ ობიექტზეც და მასივზეც) ახსენით for of დანიშნულება და განსხვავება for in სა და for of შორის კომენტარებით


let me = 
    {
        name: "nika",
        age: 15,
        city: "Gori"
    }

for(let key in me){
    console.log(key + "",  me[key])
}

// for in ფორ ციკლი ობიექტში ყველა key თისებების გადასავლელად გვინდა


// მუშაობს ისე რომ ის იღბს საკუთარ თვისებას და ციკლს იმდენჯერ გაამეორებს რამდენი თვისებაც აქვს 

let object = {
    name: "gio",
    age: 45,
    city: "Telavi"
};

for (let value of Object.values(object)) {
    console.log(value); 
}

// for of დანიშნულებაა ციკლი გადის ობიექტის მნიშნელობებზე

// for in გამოიყენება ნებისმირ კოლექციაზე და მასივებზე

// და for of არშეგვიძლია გამოვიყენოთ მასივებზე ესაა განსხვავება