// <!-- 3) შექმენით ერთი ობიექტი მასში კი დაამტეთ რაიმე კუთვნილებები, თქვენი დავალებაა რომ destructing - ის გამოყენებით ამოიღოთ მხოლოდ ორი კუთვნილება და შეინახოთ ცლადში, გამოიტანეთ console - ში, კომენტარების სახით ახსენით თუ რა არის დესტრუქცია, შეგვიძლია თუ არა დესტრუქციის დროს შევუცვალოთ კუთვნილებას თავისი სახელი

const car = {
    brand:"BMW",
    Model:"X6m",
    Year:2021,
    Millage: "20000ml"
}
const {brand,Millage} = car 
console.log(brand)
console.log(Millage)



let mil = Millage
let brnd = brand

console.log(mil)
console.log(brnd)

// დესტრუქცია არის ობიექტებიდან ან მასივიდან კუთვნილებების ამოღბა და კი შეგვიძლია დესტრუქციის დროს შევუცვალოთ კუთვნილებებს სახელები