

function App() {
  
  return (
    <>
     
    </>
  )
}

export default App


// 3) შექმენით ავტორიზაციის და რეგისტრაციის გვერდები, აგრეთვე შექმენით AuthCOntext სადაც გექნებათ შესაბამისი ფუნქციები თავისი მდგომარეობით, როდესაც მომხმარებელი დაარეგისტრირებს წარმატებით თავის აქაუნთს რეგისტრაციის ქვემოთ გამოუტანეთ კოდის დადასტურების ინპუთი, თუ კოდი წარმატებით შეიყვანა და დაადასტურა გამოუტანეთ მესიჯი და გადაიყვანეთ login ზე, ლოგინში წარმატებით ინფორმაციის შეტანის შემთხვევაში გადაიყვანეთ პროფილზე სადაც გამოიტანთ უბრალოდ მომხმარებლის სახელს, ემაილს.