const fs = require("fs")
const readline = require("readline")


const Mineinterface = readline.createInterface({
    input: fs.createReadStream("input.txt")
})

Mineinterface.on("line",line=>{
    console.log(line)
})



// Stream არის მონაცემების დინება რომელიც მოდის ნაწილ ნაწილ 
// მთლიანად ფაილის დატვირთვის ნაცვლად ეს არის ოპტიმიზირებული რადგან განსაკუთრებით დიდი ფაილებისთვის რადგან
//  არ იტვირთავს მთელ ფაილს მეხსიერებაში
//  საშუალებას აძლევს მონაცემებს დამუშავდეს ხაზდა ხაზ რეალურ დროში

// 2) გამოიყენეთ readline და fs მოდულები, იმისათვის რომ ფაილიდან ინფორმაციის წაკითხვა შეგეძლოთ ოპტიმიზირებულად (შექმენით stream) ახსენით კომენტარებით რა არის stream და რატომ არის მისი გამოყენება უკეთესი და პრაქტიკული

