// 1) შექმენით კოლექცია სახელად posts რომელიც შეიცავს posts document - ებს შესაბამისი კუთვნილებებით, mongoDb shell - ში (mongosh terminal - დან გატესტეთ ისეთი ბრძანებები რომლებიც ჩვენ დღეს ვისწავლეთ), მაგალითად დააბრუნეთ ისეთი პოსტი რომლის tags კთვნილებაც შეიცავს design, ui მნიშვნელობებს

// 2) კომენტარების სახით ახსენით თუ რას აკეთებს insertOne, insertMany, updateOne მეთოდები, და რა პარამეტრები გადაეცემა მათ

//insertOne გამოიყენება იმისთვის რომ ჩავსვათ ერთი დოკუმენტი ჩვენს კოლექციაში გადაეცემა ის დოკუმენტი რაც უნდა ჩავსვათ და დამატებითი პარამეტრი

//insertMany გამოიყენება იმისთვის რომ ჩავსვათ ბევრი დოკუმენტი კოლექციაში  გადაეცემა ის დოკუმენტები რითაც უნდა გავანახლოთ და გადაეცემა დამატებითი პარამეტრიც

// updateOne გამოიყენება იმისთვის რომ გავაახლოთ რაიმე ერთი დოკუმენტი კოლექციაში გადაეცემა filter ობიექტი,update ობიექტი


// 3) შესაბამისი მეთოდის დახმარებით posts collection - ში დაამატეთ ახალი post

// 4) insertMany - მეთოდის გამოყენებით posts collection - ში დაამატეთ + 2 დოკუმენტი

// 5) updateOne - მეთოდის გამოყენებით კი აიღეთ თქვენთვის სასურველი post - ის დოკუმენტი და განაახლეთ რომელიმე კუთვნილების მნშვნელობა