// 2) resources - ში გადმოგზავნილ რესურსს გადახედეთ, წაიკითხეთ რამოდენიმე მეთოდის შესახებ ინფორმაცია და თქვენით გატესტეთ მათი მუშაობა mongoDB terminal - ის გამოყენებით   Done

// 3) დღევანდელ გაკვეთილზე ნასწავლი ბრძანებები (ბრძანება რომელიც ერთ კონკრეტულ დუკუმენტს აბრუნებს, აბრუნებს ყველა დოკუმენტს, აბრუნებს დოკუმენტს კუთვნილებებზე დაყრდონობით, აბრუნებს და - sort - რებულ დოკუმენტებს (მაგალითად მათი likesCount - ის მიხედვით)), და ა.შ. აგრეთვე გამოიყენეთ ოპერატორები gt, lt, gte, lte - ახსენით მათი დანიშნულება


//db.posts.find({likes: {$gt: 10}}).sort({likes: 1}) ეს დააბრუნებს ყველა პოსტს რომლის ლაიკების რაოდენობაც მეტია 10 ზე და sort() მეთოდი დაალაგებს მათ თანმიმდევრულად

//db.posts.find({likes: {$lte: 110}}).sort({likes: -1}) ეს დააბრუნებს ყველა პოსტს რომლის ლაიკების რაოდენობა ნაკლებია ან ტოლია 110 ზე და sort() მეთოდი დაალაგებს მათ არათანიმდევრულად

//gt მეტია

//lt ნაკლებია

// gte მეტია ან ტოლია

//lte ნაკლებია ან ტოლია