// 1) კომენტარების სახით ახსენით $all ოპერატორის დანიშნულება, რაში ვიყენებთ ჩვენ მას
//all ოპერატორის დანიშნულებაა რომ წამოიღოს ყველაფერი მასივიდან  და მაგას იმიტომ ვიყენებთ რომ 
// წამოვიღოთ ყველა მონაცემი მასივიდან თანმიმდევრობის გადაცემის გარეშე

// 2) დააბრუნეთ ისეთი ობიექტები რომლის tags - მასივიც გამოიყურება 

// tags: [
//   'design',
//   'ui'
// ]

// ზუსტად ასე, უნდა მივაქციოთ თუ არა ყურადღება თანმიმდევრობას და რატომ

// 3) შექმენით books კოლექცია სადაც გექნებათ მოცემული წიგნების დოკუმენტები, წიგნის ობიექტი უნდა გამოიყურებოდეს მსგავსად

// {
//   bookName: name,
//   author: author,
//   rating: rating,
//   genres: ['exampleGenre1',   'exampleGenre2'...],
// }

// თქვენი დავალებაა, რომ დააბრუნოთ ისეთი დოკუმენტები რომლის genres მასივიც მოიცავს genre -  fantasy - ის

// 4) https://www.mongodb.com/docs/manual/reference/method/db.collection.find/?msockid=038ca9b2c1e96f903aa2bd82c0306e89

// გადახედეთ მოცემულ რესურსს, შეისწავლეთ 3 ახალი მეთოდი, შემდეგ კი გამოიყენეთ ისინი mongosh terminal - ში