# 1) შექმენით Number guess game, if else statement-ების გამოყენებით.
guess_number = 6 
user_input = 0
if input != guess_number:
 user_input = int(input("please enter a number 1-10: "))
# 2) შექმენით Number guess game, while ციკლების გამოყენებით.

# 3) გაიხსენეთ გაკვეთილზე გაკეთებული დავალება მომხმარებლის სისტემაში შესვლის მცდელობაზე და დამოუკიდებლად გააკეთეთ იგივე while ციკლის საშუალებით.

# 4) გადაუარეთ სტრინგს for loop-ით და სტრი გში მხოლოდ ლუწ ინდექსებზე მდგომი ასოები დაბეჭდეთ .

# 5) გამოიყენეთ range და ლუწ ინდექსებზე მდგომი რიცხვები შეკრიბეთ. ჯამი გამოიტანეთ ტერმინალში.