const express = require('express')
const morgan = require('morgan')

const app = express()

app.use(express.json())
app.use(morgan('dev'))

const bikesRouter = require('./routers/bikes.routers')
app.use('/bikes',bikesRouter)

app.listen(3000,()=>{
  console.log('server is listen on port 3000')
})




//1
//morgan არის middelware ფუნქცია  და მისი დანიშნულებაა რომ ტერმინალში გამოგიტანოს რა მეთოდით შესრულდა მოთხოვნა 
//რომელ ბილიკზე რა სტატუსის კოდით შესრულდა და რამდენ მილიწამშ

//express.json() არის middleware ფუნქცია რომელიც გამოიყენება იმისთვის, რომ
// request-ის body-ში გამოგზავნილი JSON მონაცემები წაიკითხოს და გადააქციოს JavaScript ობიექტად


//2
//Controller არის ფაილი სადაც იწერება პროგრამის ძირითადი ლოგიკა და ფუნქციები მანდ ხდება მონაცემების მიღება req,res
// და პასუხის დაბრუნება

// Router არის ფაილი სადაც ხდება ბილიკების ანუ routes ების  განსაზღვრა
// და მათი დაკავშირება შესაბამის controller ფუნქციებთან


// 2) შექმენით პროექტი სადაც შეგეძლებათ bikes - ების წამოღება, დამატება წაშლა და განახლება, მოცემული კოდები კი გადაანაწილეთ შესაბამის folder - ებში, ახსენით თქვენი სიტყევბით თუ რა არის controller, router, რა დადებითი მხარეები გააჩნიათ მათ, გამოიყენეთ შესაბამისი middleware ფუნქციები, მოცემული პროექტის მუშაობა კი გატესტეთ
// 
// 1) კომენტარების სახით ახსენით თუ რა არის morgan, express.json() რაში ვიყენებთ ჩვენ მას, აგრეთვე ახსენით მათი დანიშნულება