// 1) შექმენით ერთი ფუნქცია მასში კი ერთი ცვლადი რომელიც ინახავს რაიმე რიცხვს თვქნი დავალებაა რომ კონკრეტული ცვლადის მნიშვნელობა დაბეჭდოთ უნქციაშიც და ფუნქციის გარეთად, კომენტარების სახით ახსენით თუ რა მოხდა და რა უნდა გავაკეთეოთ იმისთვის რომ ეს პრობლემა გადავჭრათ




function number (){
let num = 7
}

console.log(num)

// ამის გადაჭრის გზაა არის ის რომ შევქმნათ გლობალურად ანუ კოდის ბლოკის გარეთ და იმუშავებს ჩვეულებრივად



// 2) კომენტარების სახით ახსენით თუ რა განსხვავებაა global და local scope - ებს შორის 


// global არის როცა კოდის ბლოკის გარეთაა შექმნილი ცვლადი  და შეგვიძლია სხვა კოდებში გამოყენებაც

// local scope  არის როცა ბლოკის შიგნითაა შექმნილი ცვლადი და მასშია მნიშვნელობა შენახული და ა.შ