// 3) შემოატანინეთ მომხმარებელს ასაკი, შეამოწმეთ თუ მომხმარებლის მიერ შემოტანილი მნიშვნელობა არის ნაკლები ან ტოლი 13 მაშინ alert - ის დახმარებით გამოიტანეთ რომ მომხმარებელი არის არასრულწლოვანი, იმ შემთხვევაში თუ მომხამრებლის მიერ შემოტანილი ასაკი მეტია ან ტოლი 13 მაშინ alert - ის დახმარებით აცნობეთ რომ ის არის თინეიჯერი, იმ შემთხვევაში თუ მომხამრებლის ასაკი მეტია 13 - ზე და 18 ზე გამოიტანეთ რომ ის არის ზრდასრული

let ages = Number(prompt("enter your age"))

if (ages <= 13) {
    alert("you aren't adult")
}
else if (ages >= 13 && ages <= 18) {
    alert("your are teenager")
}
else if (ages > 18) {
    alert("you are adult")
}
else {
    alert("please enter valid num")
}