// 1) კომენტარების სახით ახსენით განასხვავება TCP, UDP, TLS - თითოეულის დანიშნულება ახსენით თქვენი სიტყვებით, კარგად გაიაზრეთ, აგრეთვე მოიყვანეთ მაგალითებიც

//TCP -  Transmission Transfer Protocol ეს არის კომუნიკაციის პრტოკოლი 
// ეს  იცავს მონაცემების სწორი მიმდევრობას
// ანუ მასში ინფორმაცია არ იკარგება თუ პაკეტი არ მივიდა ბოლომდე

// არის უსაფრთხო მაგრამ შედარებით ნელია UDP-სთან შედარებით
// მაგალითად როცა  ვტვირთავთ YouTube ს  TCP უზრუნველყოფს რომ ყველა HTML CSS და JS ფაილი სრულად მოვიდეს და ამაში 
// არც ერთი ბაიტი ან მეგაბაიტი არ დაიკარგება


//UDP - User DataGram Protocol 
//UDP არის შედარებით არასტაბილურიპროტოკოლი ვიდრე TCP რადგან ის არამოწმებს ჩავიდა თუარა პაკეტი ბოლომდე ასევე არაკეთებს მიმდევრობას მაგრამ საკმაოდ სწრაფია ვიდრე TCP და არაგვიანებს ფაილების მიწოდებას

// თამაშში ვაგზავნით რაიმე პოზიციას  
// თუ ერთი პაკეტი დაიკარგება ეგ არაუშავს  შემდეგი წამსვე  ახალი მოვა
// აქ სისწრაფე უფრო მნიშვნელოვანია ვიდრე სიზუსტე


//TLS - Transport Layer Security 
//TLS არის მონაცემების გადსაცემი პრტოკოლი მას ასევე აქვს დაცვის ფენა  მას ასევე შეუძლია რომ გააკეთოს 
// Encryption რომ სხვამ ვერ წაიკითხოს ანუ შეუძლია გარდაქმნას ინფორმაცია ისეთ სიმბოლოებად რომ სხვამ ვერწაიკითხოს 

// მაგალითდ როცა შევდივართ Facebook-ში facebook.com
// ჩვენი  პაროლი TLS ით იშიფრება და ვერ ჰაკერი წაიკითხავს მას