// 1) შექმენით tuple typescript ის დახმარებით და ახსენით კომენტარებით რა არის და როგორ მუშაობს ის (რა შემთხვევაში შეიძლება ამოგიგდოთ პრობლემა)

let user: [string, number, boolean];
user =["Nika",20,true]
//touple არის მასივი მაგრამ ჩვეულებრივი მასივისგან იმით განსხვავდება რომ მასში შექმნისას რომ ჩავწერთ ელემენტებს შემდეგ ელემენტების ჩამატება აღარ შეგვიძლია და პრობლემა იმშემთხვევაში შეილება ამოგვიგოს რომ ჩვენ ვცადოთ რაიმე ელემეტსი ჩამატება მასში


// 2) შექმენით მათემატიკური ფუნქცია სადაც მოცემული გექნებათ ორი პარამეტრი პირველი ჩვეულებრივი და მეორე rest, ორივეს გაუწერეთ თავისი ტიპი აგრეთვე ფუნქციასაც დაუწერეთ დასაბრუნებელ;ი ტიპი

// function multiplay = (multiplier: number, ...numbers: number[]): number{

// }

// 3) შექმენით სატესტოდ მასივი სადაც გაუწერთ ტიპს და გატესტავთ რა როგორ იმუშავებს მაგალითად push []_ით შეცვლა და ასე შემდეგ

let names: string[] = ["nika", "luka", "giorgi"];
names.push("data");
 names.push[2]= "Dachi";