// 1) მოიძეთ ინფორმაცია relational Database და Non-relational database, მათი DBMS შესახებაც. შემდეგ კომენტარებით ახსენით განსხვავება მათ შორის, პლიუსები და მინუსები აგრეთვე ახსენით რა არის DBMS


// DBMS Database Management System არის სისტემა რომელიც გვაძლევს საშვალებას შევინახოთ მონაცემები მონაცემთა ბაზაში
//შევცვალოთ მონაცემები წავშალოთ და ვმართოთ ერდროულად ბევრი მომხმარებელი

//Relational Database ეს ინახავს მონაცემებს ცხრილების სახით row და collumn სახით მისი პლიუსებია კარგად დალაგებული 
//და მოწესრიგებული მონაცემები მას ასევე აქვს რთული query ები JOIN WHERE GROUP BY

//მინუსები კი ისაა რომ რთულია მისი სქემის შეცვლა და არცისე მოქნილია არასტრუქტურირებული მონაცემებისთვის


//Non related Database ეს არინახავს მონაცემებს ჩვეულებრივი ცხრილების გზით ეს ინახავს key-value graph column-based
// ამისი პლიუსები ისაა რომ აქვს მოქნილი სტრუქტურა და მუშაობს დიდი რაოდენობის მონაცემებზე

//მისი მინუსებუ კი ისაა რომ არაქვს სტანდარტული query ენა და რთული ურთიერთკავშირებიც რთულად კეთდება





