#2) ტერმინალში გაშვების გარეშე დაადგინეთ თუ რას გამოიტანს მოცემული კოდი:
#True and False or False or True and False
#ბოლოს კი გაუშვით ეს კოდი და შეამოწმეთ თქვენი ვარაუდი გამართლდა თუ არა.

#3) დაწერეთ პროგრამა, რომელიც მომხმარებელს მოსთხოვს რიცხვის შემოტანას.
#თუ შემოტანილი რიცხვი ლუწია და  მეტია ათზე დაბეჭდოს "True".
#სხვა შემთხვევაში, დაბეჭდოს "False".

#4) გადახედეთ რესურსებში ჩაგდებულ მასალას for loop-ების შესახებ.

#5) თქვენი სიტყვებით ახსენით თუ როგორ მუშაობს for loop.

#6) დაწერეთ for loop, რომელიც დაბეჭდავს რიცხვებს 1-დან 15-ის ჩათვლით.

#7) დაწერეთ for loop, რომელიც 1-დან 10-მდე ყველა რიცხვის ჯამს გამოთვლის.

#8) გადახედეთ გაკვეთილის ჩანაწერს.
# davaleba2
print(True and False or False or True and False) #False #gamartlda varaudi
#davaleba 3
num=int(input("please enter number")) 
if num % 2 == 0 and num> 10:
    print("True")
else:
    print("False")
#davaleba3 