// 1)db.products.aggregate([
//   {
//     $match: {
//       category: "phone",
//       price: { $gt: 50 }
//     }
//   },
//   {
//     $sort: { price: 1 }
//   },
//   {
//     $addFields: {
//       rating: { $rand: {} } 
//     }
//   },
//   {
//     $out: "bestphones"
//   }
// ]);


// 2) მაგალითად ქარხანა თავიდან ყველაფერი შედის ერთად შემდეგ $match დატოვებს მხოლოდ იმას რასაც ჩვენ გადავცემთ რომ დატოვოს შემდეგ წავა
//დახარისხება და $sort და ეს დაალაგებს იმ პიორბის მიხედვით რასაც ჩვენ გადავცემთ მერე კი არის $addfields ეს კი მაგალითად თითოეულ პროდუქთს მისცემს თავის ფასს და ბოლოს $out ბოლოში კი ეს გამზადებულ შედეგს გამოჰვიტანს 
