import { useState } from 'react'
import Products from './Products'
import Fruits from './Fruits'


function App() {
  
  return (
    <>
    <Products />
    <Fruits />
    </>
  )
}

export default App





// 2) გააგრძელეთ მეორე საკლასო დავალება თქვენს კოდს დაუმატეთ წაშლის ფუნქციაც, კომენტარების სახით დეტალურად ახსენით თითოული ხაზი და კარგად გაიაზრეთ


// 4) შექმენით მდგომარეობა საწყის მნიშვნელობად შეინახეთ მომხმარებლის ობიექტი {name: Your name, password: '123'}, ღილაკზე დაჭერისას
// უნდა შეცვალოთ name კუთვნილება (ჩაანაცვლეთ თქვენთვის სასურველი სახელით), უნდა გქონდეთ მეორე ღილაკი რომელზე დაჭერისას ობიექტი უნდა დაუბრუნდეს თავის პირვანდელ მნიშვნელობას