// useNavigation სა და propsNavigation შორის ის სხვაობაა რომ useNavigation ნი არის კაუჭი რომელის საშუალებითაც შეგვიძლია მივიღოთ ნავიგაციის ობიექტზე ნებისმიერ შვილ კომპონენტზე წვდომა ისე რომ prpos ების ხელით გადაცემა აღარ იქნება საჭირო და აღარ დაგვჭირდება მშობლიდან შვილზე

//props.Navigation კი ავტომატურად გადასცემს ნავიგაციის ობიექტს მთავარი კომპონენტს props ების სახით და თუ გვაქვს ბევრი შვილი კომპონენტები მათ პირდაპირ დავიგაცია არექნებათ და მოგვიწევს რომ უკვე მოხდეს props driling ანუ ხელით გადავცეთ უკვე კუთვნილებები

//აი მაგალითად გვაქვს პროდუქტების სია სადაც ყველა პრდუქტი არის გამოტანილი თითო კომპონენტად ამაზე უკვვე მშობელი კომპონენტი გამოიყენებს props.navigation ხოლო შვილ კომპონენტში კი გამოვიყენებთ useNavigate-ს რომ მასე დაჭერისას პირდაპირ გადაგვიყვანოს მის გვერდზე და არგახდეს საჭირო props driling 

//