# float ათწილადი რიცხვი მაგ: 5.2   10.6   15.7  20.3

# integer მთელი მაგ: 3 6 8 11 4

# string "ნიკა" "ზუკა"

# boolean მართალი ან მცდარი  true/false


# variables ცვლადები ცვლადები ერთგვარი ყუთი  ჯერ ვწერთ ცვლადის სახელს შემდეგ კი მნიშვნელობას მაგ: name = "nika"



# name = "zuka"  #აქ შევქმენით ცვლადი სახელად name და მისი მნიშვნელობა გავუტოლეთ zuka ს
# print(name) #აქ კი დავბეჭდეთ name ცვლადი და გამოგვიტანს ეგ მის მნიშვნელობას

# age = 16 #აქ შევქმენით ცვლადი სახელად age და მისი მნიშვნელობა გავუტოლეთ 16 ს
# print(age) #აქ კი დავბეჭდეთ age ცვლადი და გამოგვიტანს ეგ მის მნიშვნელობას

# height = 176 #აქ შევქმენით ცვლადი სახელად height და მისი მნიშვნელობა გავუტოლეთ 176 ს
# print(height) #აქ კი დავბეჭდეთ height ცვლადი და გამოგვიტანს ეგ მის მნიშვნელობას

# is_Studying = True #აქ შევქმენით ცვლადი სახელად is_Studying და მისი მნიშვნელობა გავუტოლეთ True ს
# print(is_Studying) #აქ კი დავბეჭდეთ is_Studying ცვლადი და გამოგვიტანს ეგ მის მნიშვნელობას


# list = ["hello world",73,True]
# print(list)



# დეკლარაცია რაღაცის გამოცხადება

# print() არის ჩაშენებული ფუნქცია პითონში და ის ბეჭდავს ყველა იმ მონაცემს რომელიც გადაცემულია (მის ფრჩხილებში)


number = 10
# აქ შევქმენით ცვლადი სახელად number rომლის მნიშვნელობას გავუტოლეთ 10

number = 20 
# შემდეგ აქ შევუცვალეთ მნიშვნელობა number და მნიშვნელობად გავუწერეთ 20



print(number) 
# და აქ დავბეჭდეთ number და ეს შედეგს გამოიტანს 20 
# იმიტომ გამოტანს 20 რომ კოდის წაკითხვა ხდება ზემოდან და ბოლო მნიშვნელობა იყო 20




