# <  ნაკლებობის ოპერატორი

# > მეტობის ოპერატორი

# - გამოკლების ოპერატორი

# + მიმატების ოპერატორი 

# * გამრავლების ოპერატორი

# / გაყოფის ოპერატორი 

# % ნაშთიანი გაყოფა

# == ტოლობის ოპერატორი

# != არუდრის ოპერატორი





# if თუ

# elif თუ

# else სხვა დანარჩენ შემთვხვევაში



# age = 18 აქ შევქმენით ცვლადი რომლის მნიშვნელობაც უდრის 18

# if age < 18: აქ შევქმენით if პირობა რომელიც ამოწმებს თუ ასაკი ნაკლებია 18 და თუ ასაკი ნაკლები იქნება 18 ზე დაბეჭდავს you are teen
    # print("you are tenn")

# elif age == 18:  აქ კი დავწერეთ elif პირობა და თუ ასაკი უდრის 18 წელს გამოიტანს you are 18 years old
    # print("you are 18 years old")

# else: და აქ დავწერეთ else პირობა ანუ სხვა დანარჩენ შემთხვევაში გამოიტანს you are adult
    # print("you are adult")



# num = 18 აქ შევქმენით ცვლადი სახელად num რომლის მნიშვნელობაც არის 18


# if num % 2 == 0: აქ დავწერეთ პირობა რომ თუ რიცხვი ნაშთიანი გაყოფის შემდეგ ნაშთს არმოგვცემს დაემეჭდა even/ლუწს
    # print("even")
# else: აქ გავუწერეთ სხვა დანარჩენ შემთხვევაში რაუნდა მოხდეს და ეს დაბეჭდავს odd/კენტს
    # print("odd")





# num = 22

# if num == 20:
#     print("you are 20 years old")
# elif num == 21:
#     print("you are 21 years old")
# elif num == 22:
#     print("you are 22 years old")
# else:
#     print("you are adult")





# age = 16 აქ შევქმენით ცვლადი age და მნიშვნელობად მივეცით 16

# if age != 18: აქ კი შევამოწმეთ თუ ასაკი არუდრის 18  მაგ შემთხვევაში გამოიტანდა you are child
#     print("you are child")

# else: აქ კი გავუწერეთ სხვა დანარჩენ შემთხვევაში რაუნდ აგამოეტანა
#     print("you are adult")










#  for loop ვიყენებთ მაშინ როცა ვიცით რამდენი ინტერაცია დაგვჭირდება ანუ რამდეჯერ უნდა გამერდეს ჩვენი კოდი

# for i in range (9): აქ დავწერეთ for loop რომელიც ამოიღებს მნიშვნელობებს 0-9 მდე რადგან ჩვენ range ში გავუწერეთ 9 და i ყოველ ინტერაციაზე გახდება ჯერ 0 შემდეგ 1 შემდეგ 2 და ასე შემდეგ
#     print(i)

# names = ["Zuka","Nika","Gio"]  შევქმენით სია სახელად names რომელშიც შევინახეთ სახელები

# for i in names: აქ კი ამსიას გადავუარეთ for loop ის მეშვებით და ამოვიღეთ მნიშვნელობები names მასივიდან და i ყოველ ინტერაციაზე გახდა ეგ მნიშვნელობა
    # print(i)


  

# for i in range (1,9):  აქ დავწერეთ for loop რომელიც რომელიც გამოტანს რიცხვებს 1-9 ის ჩათვლით მას საწყის მნიშვნელობად გადავეცით 1 და ის ათვლად დაიწყებს 1 იდან
    # print(i)





# x = 0

#  while loop ვიყენებთ მაშინ როცა არვიცით რამდენი ინტერაცია დაგვჭირდება 

# while x < 5:  აქ დავწერეთ while loop რომელიც გადაულის x ცვლას და ნახავს სანამ პირობა იქნება true მანამდე იმუშავბს და როცა პირობა გახდება false მაშინ გაჩერდება
    # print(x)
    # x += 1 აქ გავუწერეთ რომ ყოველ ინტერაციაზე დაპლიუსდეს ჩვენი x ცვლადი 1 ით




# inp = int(input("please enter a number: "))  აქ შევქმენით ცვლადი სახელად inp რომელიც ინახავს input  და ჩვენ ეს ინფუთი გადავაქციეთ ინტეჯერად
#  ანუ მთელ რიცხვად int() ის საშუალებით 

# if(inp % 2 == 0): და აქ შევამოწმეთ რომ მომხმარებლის მიერ შემოტანილი რიცხვი არის თუარა კენტი ან ლუწი if შეამოწმებს მას და შედეგს გამოიტანს ტერმინალში
#     print("luwi")
# else:
#     print("kentia")