// 2) CRUD I: Finding Documents, CRUD I Querying on Array Fields, სექციებიდან + გაკვეთილებზე ახსნილ ბრძანებებზე, გააკეთეთ თითო მაგალითი, გატესტეთ თითოეული ბრძანების მუშაობა სხვადასხვა გზით MongoDB terminal, (mongosh) - ში

//db.posts.find({"author.name": "Zurab"})
//db.posts.find()
//db.posts.find({likes: {$gt:10},"metadata.views": {$gte: 30}})

// 3) შექმენით ფაილი სადაც კომენტარების სახით ჩამოწერთ ყველა იმ ბრძანების დანიშნულებას რომლებიც თქვენ ისწავლეთ, ახსენით დაწერილი ბრძანებების დანიშნულება + როგორ ხდება მათი გამოყენება
// $lt ნაკლებია

// $lte ნაკლებია ან ტოლია

// $gte მეტია ან ტოლია

// $all ყველა 

//$in თუ შეიცავს

//db.collection.find({}) ეს მეთოდი დააბრუნებს ყველაფერს იმაზე რა კოლექციასაც გადავცემთ და რაპირობითაც

//db.collection.find({}) ეს მეთოდი კი დააბრუნებს ყველაფერს იმას რა კოლექციასაც გადავცემთ

//db.collection.find().sort() ეს კი თან დააბრუნებს და დაალაგებს კოლექციას თუ sort() გადავეცით 1 დაალაგებს თანმიმდევრობით და თუ -1 არეულად დაალაგებს

// Projection
// db.collection.find({}, { field1: 1, field2: 1, _id: 0 })
// განსაზღვრავს რომელი ველები დაბრუნდეს შედეგში

