//db.posts.find() ყველაფერის დაბრუნება
//db.posts.find({likes: {$gt: 10}}).sort({likes: 1}) // დააბრუნე ყველა ის პოსტი რომელის ლაიქიც იყო მეტი 10 ზე და დაალაგე თანმიმდევრობით

//gt greather-Than მეტია ამას ვიყენებთ მაშინ როცა გვინდა რომ ისეთი რაღაც დავაბრუნოთ რაც მეტია რაღაცაზე

//ls less-Than ნაკლებია ამას ვიყენებთ მაშინ როცა გვინდა რომ ისეთი რაღაც დავაბრუნოთ რაც ნაკლებია რაღაცაზე

//gte greather-Than-Equal მეტია ან ტოლია ამას ვიყენებთ მაშინ როცა გვინდა რომ ისეთი რაღაც დავაბრუნოთ რაც მეტია ან ტოლია რაღაცაზე

//lte less-Than-Equal ნაკლებია ან ტოლია ამას ვიყენებთ მაშინ როცა გვინდა რომ ისეთი რაღაც დავაბრუნოთ რაც ნაკლებია ან ტოლია რაღაცაზე