// 4) შექმენით ფუნქცია სახელად manualForEach რომელსაც გადაეცემა arr და cb, ამ ფუნქციის ლოგიკა უნდა იყოს ისეთივე როიგორიც არის forEach (ახსენით რა არის callback ფუნქცია, რას აკეთებს forEach და რა არის აბსტრაქცია)


function manualForEach(arr, cb) {
    for (let i = 0; i < arr.length; i++) {
        cb(arr[i], i, arr)
    }
}

// foreach არის მეთოდი რომელშიც ჩაშენებულია ციკლი

// აბსტაქცია არის ის რაღც რასასც ვხედავთ რაც გვჭირდება მაგალითად ვნახეთ ფუნქციის სახელი და უკვე ვიცით ეგფუნქცია რასაკეთებს მთელი კოდის ნახვის გარეშე


// callback გადაეცემა სხვა ფუნქციას არგუმენტად და ხდება გამოძახება
