// 3) გამოიყენეთ fetch ფუნქცია, მოიძიეთ მის შესახებ ინფრომაცია თუ რას აკეთებს და ახსენით კომენტარებით. გააგზავნეთ მოთხოვნა https://fakestoreapi.com/products ამ მისამართზე, დაბრუნებული დაპირება კი მართეთ then და catchმეთოდებით. ახსენით ორივე მეთოდის დანიშნულება + გამოიყენეთ finally მეთოდი (ანალოგიურად ახსენით ამ მეთოდის დანიშნულება)

fetch("https://fakestoreapi.com/products")
.then(rsl => rsl.json())
.then(dt => console.log(dt))
.catch(ct => console.log("this is eror"))
.finally(fnl => console.log(fnl))



// fetch ფუნქცია არის ის რაც აგზავნის მოთხოვნას სერვერთან ინფორმაცცის მისაღებად ანუ ჩვენ fetch() ით ვაგზავნით მოთხოვნას სერვერთან ინფორმაცცის მიღებისთის

//.then აბრუნებს მნიშვნელობას თუ არის resolve ანუ შესრულებული

//.catch აბრუნებს მნიშვნელობას თუ არის reject ანუ არშესრულებულა

// finally არის promise მეთოდი და მაინც შესრულდება გინდ .then()  იყოს გინდ .catch()