// CSR ანუ Client side Rendering ამის დროს სერვერი ბრაუზერს უგზავნის js ფაილს ამას შემდეგ იწერს და აწყობს უკვე მთლიან ინტერფეისს ამისის დადებითი და კარგი მხარეებია ძალიან სწრაფად გადადის გვერდიადან გვერდზე 

// SSR Server-Side Rendering ეს კი ყოველ ჯერზე როცა მომხმაებელი გამოაგზავნის მოთხოვნას სერევერი რეალურ დროში დაუგენერირებს გამზადებულ htmls და გააგზავნის ბაზაში და ამისის დადებითი მხარე ისაა რომმ საკმაოდ სწარფია და კარგად მუშაობს seo სთან

// SSG Static Site Generation ეს კი აგენერირებს html გვერდებს პროექტის დაბილდვისას სანამ საიტი შეიქმნება სერვერზე ამისი კარგი მხარე ისაა რომ სწრაფია და უცებ იტვირთება და ა.შ   

