"use strict";
let message = "გამარჯობა!";
console.log(message);

// 1) მოიძიეთ ინფორმაცია tsconfig შესახებ და ისწავლეთ რაში გვჭრდება
//tsconfig არის ფაილი რომელიც ეხმარება typescript ის კომპილატორს ანუ tsc თუ როგორ გადათარგმნოს typescript ის კოდი
//js ში
// 2) მოიძიეთ ინფორმაცია იმის შესახებ თუ როგორ უნდა გამოიყენოთ ts თქვენივე კომპიუტერში ანუ ისწავლეთ tsc (ტრანბსპილერის გამოყენება) 
//ts გამოყენებას კომპილაცია ქვია და უკვე ხელსაწყო რომელიც ამის გარდაქმნას აკეთებს არის tsc მისი გამოყენება ხდება რომ ჯერ უნდა დავაყენოთ typescript ის გლობალური ვერსია და შემდეგ უკვე ტერმინალში ვწერთ tsc ბრძანებას და შემდეგ ვუწერთ იმ ფაილის სახელს რომელზეც გვინდა რომ გამოვიყენოთ
