import { useState } from 'react'

function App() {


  return (
    <>
     
    </>
  )
}

export default App







// 1) კომენტერბის სახით დეტალურად ახსენით განსხვავება useMemo, useCallBack კაუჭებს შორის, ასევე ახსენით თუ რა არის memo - და რაში გამოვიყენებთ ჩვენ მას

// 2)  მომხმარებელს input - ით შემოატანინეთ რაიმე რიცხვი, თქვენი დავალებაა, რომ გამოთვალოთ მოცემული რიცხვის factorial, გამოიყენეთ useMemo კაუჭი ოპტიმიზაციისთვის, ფუნქცია რომელიც ითვლის მომხმარბელის მიერ შემოტანილი რიცხვის factorial - ს უნდა გაეშვას მხოლოდ მაშინ როდესაც რიცხვი შეიცვლება, საიტზე უნდა გქონდეთ ორი input - ი, პირველი იქნება ის input - ი რომელშიც მომხმარებელი შემოიტანს რაიმე რიცხვს, მეორე იქნება ტექსტისთვის, დააკვირდით მუშაობას, კოდი დეტალურად ახსენით კომენტარების სახით

// 3) შექმენით ორი კომპონენტი,  1.Parent, 2.Child, Parent კომპონენტში უნდა გქონდეთ count მდგომარეობა და input - ი ტექსტისთვის, უნდა გქონდეთ handleClick ფუნქცია რომელიც count მდოგმარეობას შეცვლის, გამოიძახეთ Child კომპონენტი და props - ად გადაეცით თქვენს მიერ შექმნილი handleClick ფუნქცია, დააკვირდით მუშაობას, Child კომპონენტმა რომ არ გამოიწვიოს ყოველ ჯერზე ხელახლა დარენდერება გამოიყენეთ useCallBack, memo, კოდი დეტალურად ახსენით კომენტარების სახით

// 4) თქვენს პროექტში, სადაც თვლით, რომ გესაჭიროებათ ისეთი ფუნქციების ოპტიმიზაცია რომელიც მუშაობს ნელა, დაამატეთ (გამოიყენეთ useMemo, useCallback ან  memo)

// 5) კარგად გაიაზრეთ useMemo, useCallBack კაუჭების მუშაობა, თქვენით ივარჯიშეთ და გააკეთეთ 2-2 მაგალითი თითოეულზე

// 6) კომენტარების სახით ახსენით თუ რა არის ძვირიანი გამოთვლა (expensive calculation)