import { useState } from 'react'
import Parent from './Parent'
import Inp from './Input'


function App() {


  return (
    <>
    <Parent />
    <Inp />
     
    </>
  )
}

export default App







// 1) კომენტერბის სახით დეტალურად ახსენით განსხვავება useMemo, useCallBack კაუჭებს შორის, ასევე ახსენით თუ რა არის memo - და რაში გამოვიყენებთ ჩვენ მას
// useCallback და useMemo ორივე არის რეაქთის ოპტიმიზაციის კაუჭი
//   useMemo ს ვიყენებთ მაშინ როდესაც ვაკეთებთ მძიმე გამოთვლას ანუ მაგალითად დიდ რიცხვებზე და ა.შ useMemo გვიბრუნებს გამოთვლილ მნიშვნელობას
// useCallback ვიყენებთ იმისათის რომ შევინახოთ ფუნქციები და აღარ დაგვჭირდეს მათ ყოველ გამოყენებაზე რომ ახლიდან დარენდერდეს და მას გამოვიყენებთ ქეშირებისთვის




// 4) თქვენს პროექტში, სადაც თვლით, რომ გესაჭიროებათ ისეთი ფუნქციების ოპტიმიზაცია რომელიც მუშაობს ნელა, დაამატეთ (გამოიყენეთ useMemo, useCallback ან  memo)

// 5) კარგად გაიაზრეთ useMemo, useCallBack კაუჭების მუშაობა, თქვენით ივარჯიშეთ და გააკეთეთ 2-2 მაგალითი თითოეულზე




// 6) კომენტარების სახით ახსენით თუ რა არის ძვირიანი გამოთვლა (expensive calculation)
// exspensive calculations ანუ ძვირადღირებული ფუნქციები არის ისეთი ფუნქცია რომელიც დიდი დროს ანდომებს მის მუშაობას ანუ დიდი დრო ჭირდება რენდერისთის და შედეგის გამოტანისთვის და ამის გამო ეს საკმაოდ ანელებს ფუქციას