import { useState } from 'react'
import Products from './Products'





function App() {
  return (
    <>
   

    <Products />
    </>
  )
}

export default App


// 1) შექმენით counter ფუნქცია, რიომელიც დაკლიკებაზე ითვლის რაოდენობას, ჯერ გააკეთეთ ცუდი გზით ორჯერ გამოიძახეთ setCount ფუნქცია და გატესტეთ როგორ მუშაობს და რატომ მუშაობს ახსენით კომენტარებით, შემდეგ კი გამოიყენეთ საუკეთესო პრაქტიკა, მდგომარეობის შემცვლელ ანუ setCount გადაეცით ფუნქცია ისიც ორჯერ გამოიძახეთ ერთდროულად და ნახეთ შედეგი, ახსენით კომენტარებით რატომ და როგორ იმუშავა ესე.
