import React from "react";
import ColorProvider from "./ColorProvider";
import Child from "./Child";

function App() {
  return (
    <ColorProvider>
      <Child />
    </ColorProvider>
  );
}

export default App;




// 1) შექმენით კონტექსტი თქვენს App ში შემდეგ, შექმენით ერთი კომპონენტი სახელად child, app კომპონენტში გამოიძახეთ ორჯერ child კომპონენტი და მოაქციეთ Provider კომპონენტის თეგებს შორის ორივეჯერ, ერთი პროვაიდერიდან გააზიარეთ მნიშვნელბა "Hello" მეორედან "Bye", შემდეგ child კომპონენტში გამოიყენეთ ეს კონტექტსი და ახსენით კომენტარებით კონტექსტის მუშაობა და მთავარი დანიშნულება












// 2) შექმენით ColorProvider კომპონენტი, რომელიდანაც დააბრუნებთ ColorContext.Provider ში ჩასმულ შვილ ელემენტებს, შემდეგ მაგ კომპონეტში შექმენით randomColor ფუნქცია რომელიც შემთხვევით ფერს აწარმოებს hex ფორმატში და აგრეთვე color მდგომარეობა თავისი handleClick ფუნქციით რომელიც უნდა იძახებდეს randomColor ფუნქციას და დაბრუნებულ შედეგს უნდა ანიჭებდეს მდგომარეობას, საბოლოოდ გადაეცით ეს handleClick ფუნქცია და color მდგჰომარეობა ობიექტს და ობიექტი გადაეცით value ატრიბუტს, შემდეგ გამოიძახეთ ის App კომპონენტში და გადაეცით Child კომპონენტი, child კომპონენტი კი უნდა აბრუნებდეს Div ბლოკს როპმლის ფერიც იქნება შემთხვევით მიღებული ფერი ფუნქციიდან, აგრეთვე დაამატეთ ღილაკი, ღილაკზე დაკლიკებისას კი ეს ფერი უნდა იცვლებოდეს

