// 2) კარგად გაიაზრეთ insertOne, insertMany, updateOne, updateMany მეთოდების დანიშნულება, გამოიყენეთ ისინი MongoDB shell - ში, აგრეთვე ახსენით თუ რას აკეთებს upsert კუთვნილება

// db.posts.insertOne({ title: "First post",
  // likes: 10,
  // tags: ["mongodb", "database"]})
  // db.posts.updateOne({title:"Sixth Post"}, {$set: {author: "Nikoo"}})

// 3) შექმენით კოლექცია სახელად students სადაც გექნებათ მოცემული სტუდენტების დოკუმენტები შესაბამისი კუთვნილებებით, insertMany მეთოდის გამოყენებით დაამატეთ 2 სტუდენტი, აგრეთვე განაახლეთ სტუდენტის ობიექტში რომელიმე კუთვნილება $set ოპერატორის დახმარებით (ახსენით ამ ოპერატორის დანიშნულება კომენტარების სახით)

// 4) გამოიყენეთ ყველა ის მეთოდი რაც ისწავლეთ, თქვენით ივარჯიშეთ და გააკეთეთ თითოეულზე გააკეთეთ 2 - 2 მაგალითი

// 5) CRUD II: Deleting Documents - დან შეისწავლეთ რამოდენიმე მეთოდი და გამოიყენეთ ისინი